//=============================================================================
// 
// デバッグ表示ヘッダー [ debugproc.h ]
// Author : 中澤優奈
// 
//=============================================================================
#ifndef _DEBUGPROC_H_		// このマクロ定義がされていなかったら
#define _DEBUGPROC_H_		// 2重インクルード防止のマクロを定義する

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_DEBUGSTRING		(2048)			// デバッグ表示の最大文字数

//*****************************************************************************
// デバッグ表示クラス
//*****************************************************************************
class CDebugProc
{
public:
	CDebugProc();
	~CDebugProc();

	HRESULT Init(void);
	void Uninit(void);
	void Update(void);
	void Draw(void);

	void Print(const char* fmt, ...);

private:
	static LPD3DXFONT m_pFont;					// フォントへのポインタ
	static char m_aStrDebug[MAX_DEBUGSTRING];	// 文字列(デバッグ情報)を格納するバッファ
	static bool m_bDebug;						// デバッグ表示のON/OFF
};

#endif