//========================================================================
// 
// エネルギー鉱物 [energyrock.cpp]
// Author : Nakazawa Yuna
// 
//========================================================================
#include "energyrock.h"

#include "renderer.h"
#include "manager.h"

//************************************************************************
// マクロ定義
//************************************************************************

//========================================================================
// エネルギー鉱物クラスの生成処理
//========================================================================
CEnergyRock* CEnergyRock::Create(const D3DXVECTOR3 pos, const D3DXVECTOR3 rot)
{
	if (CObject::GetNumAll() >= MAX_OBJECT)
	{// 最大数のオブジェクトが存在する
		OutputDebugStringA("! ! ! オブジェクトの最大数に達しています ! ! !\n");

		return NULL;
	}

	CEnergyRock* pEnergyRock = NULL;

	if (pEnergyRock == NULL)
	{// NULLチェック
		// エネルギー鉱物の生成
		pEnergyRock = new CEnergyRock;
	}

	if (pEnergyRock != NULL)
	{// NULLチェック
		// モデルファイル設定
		pEnergyRock->BindModel("data\\MODEL\\energyrock.x");

		// 初期化処理
		if (FAILED(pEnergyRock->Init(pos, rot)))
		{// もし失敗した場合
			OutputDebugStringA("! ! ! エネルギー鉱物の初期化に失敗しました ! ! !\n");

			return NULL;
		}

		// 種類を設定
		pEnergyRock->SetType(TYPE_ENERGYROCK);

		return pEnergyRock;
	}

	OutputDebugStringA("! ! ! エネルギー鉱物の生成に失敗しました ! ! !\n");

	return NULL;
}

//========================================================================
// エネルギー鉱物クラスのコンストラクタ
//========================================================================
CEnergyRock::CEnergyRock(const int nPriority) :CObjectX(nPriority)
{
	// エネルギー鉱物クラスの値をクリア
}

//========================================================================
// エネルギー鉱物クラスのデストラクタ
//========================================================================
CEnergyRock::~CEnergyRock()
{
}

//========================================================================
// エネルギー鉱物の初期化処理
//========================================================================
HRESULT CEnergyRock::Init(const D3DXVECTOR3 pos, const D3DXVECTOR3 rot)
{
	// 初期化処理
	CObjectX::Init(pos);

	// 位置/向きを設定
	CObjectX::SetPosition(pos);
	CObjectX::SetRotation(rot);

	return S_OK;
}

//========================================================================
// エネルギー鉱物の終了処理
//========================================================================
void CEnergyRock::Uninit(void)
{
	// 終了処理
	CObjectX::Uninit();
}

//========================================================================
// エネルギー鉱物の更新処理
//========================================================================
void CEnergyRock::Update(void)
{
}

//========================================================================
// エネルギー鉱物の描画処理
//========================================================================
void CEnergyRock::Draw(void)
{
	// 描画処理
	CObjectX::Draw();
}